---
kind: method
id: M:Autodesk.Revit.DB.RoutingPreferenceRule.Dispose
source: html/42fcd3b4-51db-541a-f6ad-b5614a466fe6.htm
---
# Autodesk.Revit.DB.RoutingPreferenceRule.Dispose Method

Releases all resources used by the RoutingPreferenceRule

## Syntax (C#)
```csharp
public void Dispose()
```